
## Plan Result (aat)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 0 to change, 4 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.app_insights_connection_string
* Delete
  * azurerm_key_vault_secret.storage_account_connection_string
  * azurerm_key_vault_secret.storage_account_name
  * azurerm_key_vault_secret.storage_account_primary_key
  * azurerm_storage_account.storage_account


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.app_insights_connection_string will be created
  + resource "azurerm_key_vault_secret" "app_insights_connection_string" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpts-aat/providers/Microsoft.KeyVault/vaults/rpts-aat"
      + name                    = "app-insights-connection-string"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.storage_account_connection_string will be destroyed
  # (because azurerm_key_vault_secret.storage_account_connection_string is not in configuration)
  - resource "azurerm_key_vault_secret" "storage_account_connection_string" {
      - id                      = "https://rpts-aat.vault.azure.net/secrets/storage-account-connection-string/9fe8e6aa998b463b9c0a49875d6f9278" -> null
      - key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpts-aat/providers/Microsoft.KeyVault/vaults/rpts-aat" -> null
      - name                    = "storage-account-connection-string" -> null
      - resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpts-aat/providers/Microsoft.KeyVault/vaults/rpts-aat/secrets/storage-account-connection-string/versions/9fe8e6aa998b463b9c0a49875d6f9278" -> null
      - resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpts-aat/providers/Microsoft.KeyVault/vaults/rpts-aat/secrets/storage-account-connection-string" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "9fe8e6aa998b463b9c0a49875d6f9278" -> null
      - versionless_id          = "https://rpts-aat.vault.azure.net/secrets/storage-account-connection-string" -> null
        # (1 unchanged attribute hidden)
    }

  # azurerm_key_vault_secret.storage_account_name will be destroyed
  # (because azurerm_key_vault_secret.storage_account_name is not in configuration)
  - resource "azurerm_key_vault_secret" "storage_account_name" {
      - id                      = "https://rpts-aat.vault.azure.net/secrets/storage-account-name/4175d3e83a6b4b0488845d26ea9892c9" -> null
      - key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpts-aat/providers/Microsoft.KeyVault/vaults/rpts-aat" -> null
      - name                    = "storage-account-name" -> null
      - resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpts-aat/providers/Microsoft.KeyVault/vaults/rpts-aat/secrets/storage-account-name/versions/4175d3e83a6b4b0488845d26ea9892c9" -> null
      - resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpts-aat/providers/Microsoft.KeyVault/vaults/rpts-aat/secrets/storage-account-name" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "4175d3e83a6b4b0488845d26ea9892c9" -> null
      - versionless_id          = "https://rpts-aat.vault.azure.net/secrets/storage-account-name" -> null
        # (1 unchanged attribute hidden)
    }

  # azurerm_key_vault_secret.storage_account_primary_key will be destroyed
  # (because azurerm_key_vault_secret.storage_account_primary_key is not in configuration)
  - resource "azurerm_key_vault_secret" "storage_account_primary_key" {
      - id                      = "https://rpts-aat.vault.azure.net/secrets/storage-account-primary-key/753dc8ff266d48b383f0563613171b41" -> null
      - key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpts-aat/providers/Microsoft.KeyVault/vaults/rpts-aat" -> null
      - name                    = "storage-account-primary-key" -> null
      - resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpts-aat/providers/Microsoft.KeyVault/vaults/rpts-aat/secrets/storage-account-primary-key/versions/753dc8ff266d48b383f0563613171b41" -> null
      - resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpts-aat/providers/Microsoft.KeyVault/vaults/rpts-aat/secrets/storage-account-primary-key" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "753dc8ff266d48b383f0563613171b41" -> null
      - versionless_id          = "https://rpts-aat.vault.azure.net/secrets/storage-account-primary-key" -> null
        # (1 unchanged attribute hidden)
    }

  # azurerm_storage_account.storage_account will be destroyed
  # (because azurerm_storage_account.storage_account is not in configuration)
  - resource "azurerm_storage_account" "storage_account" {
      - access_tier                        = "Hot" -> null
      - account_kind                       = "StorageV2" -> null
      - account_replication_type           = "LRS" -> null
      - account_tier                       = "Standard" -> null
      - allow_nested_items_to_be_public    = true -> null
      - cross_tenant_replication_enabled   = false -> null
      - default_to_oauth_authentication    = false -> null
      - dns_endpoint_type                  = "Standard" -> null
      - https_traffic_only_enabled         = true -> null
      - id                                 = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpts-aat/providers/Microsoft.Storage/storageAccounts/rptsaat" -> null
      - infrastructure_encryption_enabled  = false -> null
      - is_hns_enabled                     = false -> null
      - large_file_share_enabled           = false -> null
      - local_user_enabled                 = true -> null
      - location                           = "uksouth" -> null
      - min_tls_version                    = "TLS1_2" -> null
      - name                               = "rptsaat" -> null
      - nfsv3_enabled                      = false -> null
      - primary_access_key                 = (sensitive value) -> null
      - primary_blob_connection_string     = (sensitive value) -> null
      - primary_blob_endpoint              = "https://rptsaat.blob.core.windows.net/" -> null
      - primary_blob_host                  = "rptsaat.blob.core.windows.net" -> null
      - primary_connection_string          = (sensitive value) -> null
      - primary_dfs_endpoint               = "https://rptsaat.dfs.core.windows.net/" -> null
      - primary_dfs_host                   = "rptsaat.dfs.core.windows.net" -> null
      - primary_file_endpoint              = "https://rptsaat.file.core.windows.net/" -> null
      - primary_file_host                  = "rptsaat.file.core.windows.net" -> null
      - primary_location                   = "uksouth" -> null
      - primary_queue_endpoint             = "https://rptsaat.queue.core.windows.net/" -> null
      - primary_queue_host                 = "rptsaat.queue.core.windows.net" -> null
      - primary_table_endpoint             = "https://rptsaat.table.core.windows.net/" -> null
      - primary_table_host                 = "rptsaat.table.core.windows.net" -> null
      - primary_web_endpoint               = "https://rptsaat.z33.web.core.windows.net/" -> null
      - primary_web_host                   = "rptsaat.z33.web.core.windows.net" -> null
      - public_network_access_enabled      = true -> null
      - queue_encryption_key_type          = "Service" -> null
      - resource_group_name                = "rpts-aat" -> null
      - secondary_access_key               = (sensitive value) -> null
      - secondary_connection_string        = (sensitive value) -> null
      - sftp_enabled                       = false -> null
      - shared_access_key_enabled          = true -> null
      - table_encryption_key_type          = "Service" -> null
      - tags                               = {
          - "application"         = "residential-property-tribunals"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/HMCTS/rpts-shared-infrastructure.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#fact-tech"
          - "environment"         = "staging"
          - "managedBy"           = "Residential Property Tribunals"
        } -> null
        # (56 unchanged attributes hidden)

      - blob_properties {
          - change_feed_enabled           = false -> null
          - change_feed_retention_in_days = 0 -> null
          - last_access_time_enabled      = false -> null
          - versioning_enabled            = false -> null
            # (1 unchanged attribute hidden)
        }

      - network_rules {
          - bypass                     = [
              - "AzureServices",
            ] -> null
          - default_action             = "Allow" -> null
          - ip_rules                   = [] -> null
          - virtual_network_subnet_ids = [] -> null

          - private_link_access {
              - endpoint_resource_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/providers/Microsoft.Security/datascanners/storageDataScanner" -> null
              - endpoint_tenant_id   = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
            }
        }

      - queue_properties {
          - hour_metrics {
              - enabled               = true -> null
              - include_apis          = true -> null
              - retention_policy_days = 31 -> null
              - version               = "1.0" -> null
            }
          - logging {
              - delete                = true -> null
              - read                  = true -> null
              - retention_policy_days = 31 -> null
              - version               = "1.0" -> null
              - write                 = true -> null
            }
          - minute_metrics {
              - enabled               = true -> null
              - include_apis          = true -> null
              - retention_policy_days = 5 -> null
              - version               = "1.0" -> null
            }
        }

      - share_properties {
          - retention_policy {
              - days = 7 -> null
            }
        }
    }

Plan: 1 to add, 0 to change, 4 to destroy.

Changes to Outputs:
  - storage_account_name        = "rptsaat" -> null
  - storage_account_primary_key = (sensitive value) -> null
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":61,"Program":"tfcmt","SHA1":"","Target":"aat","Vars":{}} -->